buzzwang1/pcb/source/main/CH32V305/LeuchtEi/AppDebugV9/USB_CDC_Device/ch32v30x_usbhs_device.cpp
    return 0;
}

/*********************************************************************
 * @fn      USBHS_IRQHandler
 *
 * @brief   This function handles USBHS exception.
 *
 * @return  none
 */
void USBHS_IRQHandler( void )
{
    uint8_t  intflag, intst, errflag;
    uint16_t len;

    intflag = USBHSD->INT_FG;
    intst = USBHSD->INT_ST;

    if( intflag & USBHS_UIF_TRANSFER )
    {
        switch ( intst & USBHS_UIS_TOKEN_MASK )
        {
            /* data-in stage processing */
            case USBHS_UIS_TOKEN_IN:
                switch ( intst & ( USBHS_UIS_TOKEN_MASK | USBHS_UIS_ENDP_MASK ) )
                {
                    /* end-point 0 data in interrupt */
                    case USBHS_UIS_TOKEN_IN | DEF_UEP0:
                        if( USBHS_SetupReqLen == 0 )
                        {
                            USBHSD->UEP0_RX_CTRL = USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_ACK;
                        }
                        if ( ( USBHS_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
                        {
                            /* Non-standard request endpoint 0 Data upload */
                        }
                        else
                        {
                            /* Standard request endpoint 0 Data upload */
                            switch( USBHS_SetupReqCode )
                            {
                                case USB_GET_DESCRIPTOR:
                                    len = USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                                    memcpy(USBHS_EP0_Buf, pUSBHS_Descr, len);
                                    USBHS_SetupReqLen -= len;
                                    pUSBHS_Descr += len;
                                    USBHSD->UEP0_TX_LEN = len;
                                    USBHSD->UEP0_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                                    break;

                                case USB_SET_ADDRESS:
                                    USBHSD->DEV_AD = USBHS_DevAddr;
                                    break;

                                default:
                                    USBHSD->UEP0_TX_LEN = 0;
                                    break;
                            }
                        }

                        /* test mode */
                        if( USBHS_Test_Flag & 0x80 )
                        {
                            USB_TestMode_Deal( );
                        }
                        break;

                    /* end-point 1 data in interrupt */
                    case USBHS_UIS_TOKEN_IN | DEF_UEP2:
                        USBHSD->UEP2_TX_CTRL = (USBHSD->UEP2_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_NAK;
                        USBHSD->UEP2_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                        USBHS_Endp_Busy[ DEF_UEP2 ] &= ~DEF_UEP_BUSY;
                        Uart.Tx.USB_Up_IngFlag = 0x00;
                        break;

                    /* end-point 4 data in interrupt */
                    case USBHS_UIS_TOKEN_IN | DEF_UEP3:
                        USBHSD->UEP3_TX_CTRL = (USBHSD->UEP3_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_NAK;
                        USBHSD->UEP3_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                        USBHS_Endp_Busy[ DEF_UEP3 ] &= ~DEF_UEP_BUSY;
                        break;

                    default :
                        break;
                }
                break;

            /* data-out stage processing */
            case USBHS_UIS_TOKEN_OUT:
                switch( intst & ( USBHS_UIS_TOKEN_MASK | USBHS_UIS_ENDP_MASK ) )
                {
                    /* end-point 0 data out interrupt */
                    case USBHS_UIS_TOKEN_OUT | DEF_UEP0:
                         len = USBHSH->RX_LEN;
                         if ( intst & USBHS_UIS_TOG_OK )
                         {
                             /* if any processing about rx, set it here */
                             if ( ( USBHS_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
                             {
                                 USBHS_SetupReqLen = 0;
                                 /* Non-standard request end-point 0 Data download */
                                 if( USBHS_SetupReqCode == CDC_SET_LINE_CODING )
                                 {
                                     /* Save relevant parameters such as serial port baud rate */
                                     /* The downlinked data is processed in the endpoint 0 OUT packet, the 7 bytes of the downlink are, in order
                                        4 bytes: baud rate value: lowest baud rate byte, next lowest baud rate byte, next highest baud rate byte, highest baud rate byte.
                                        1 byte: number of stop bits (0: 1 stop bit; 1: 1.5 stop bit; 2: 2 stop bits).
                                        1 byte: number of parity bits (0: None; 1: Odd; 2: Even; 3: Mark; 4: Space).
                                        1 byte: number of data bits (5,6,7,8,16); */
                                     // Uart.Com_Cfg[ 0 ] = USBHS_EP0_Buf[ 0 ];
                                     // Uart.Com_Cfg[ 1 ] = USBHS_EP0_Buf[ 1 ];
                                     // Uart.Com_Cfg[ 2 ] = USBHS_EP0_Buf[ 2 ];
                                     // Uart.Com_Cfg[ 3 ] = USBHS_EP0_Buf[ 3 ];
                                     // Uart.Com_Cfg[ 4 ] = USBHS_EP0_Buf[ 4 ];
                                     // Uart.Com_Cfg[ 5 ] = USBHS_EP0_Buf[ 5 ];
                                     // Uart.Com_Cfg[ 6 ] = USBHS_EP0_Buf[ 6 ];
                                     // Uart.Com_Cfg[ 7 ] = DEF_UARTx_RX_TIMEOUT;

                                     /* save bauds */
                                     //baudrate = USBHS_EP0_Buf[ 0 ];
                                     //baudrate += ((uint32_t)USBHS_EP0_Buf[ 1 ] << 8 );
                                     //baudrate += ((uint32_t)USBHS_EP0_Buf[ 2 ] << 16 );
                                     //baudrate += ((uint32_t)USBHS_EP0_Buf[ 3 ] << 24 );
                                     //Uart.Com_Cfg[ 7 ] = Uart.Rx_TimeOutMax;
                                 }
                             }
                             else
                             {
                                 /* Standard request end-point 0 Data download */
                             }

