buzzwang1/pcb/source/main/CH32V305/LeuchtEi/AppDebugV9/USB_CDC_Device/ch32v30x_usbhs_device.cpp
                             if( USBHS_SetupReqLen == 0 )
                             {
                                 USBHSD->UEP0_TX_LEN  = 0;
                                 USBHSD->UEP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_ACK;
                             }
                         }
                            break;

                    /* end-point 1 data out interrupt */
                    case USBHS_UIS_TOKEN_OUT | DEF_UEP2:
                        /* Endp download */
                        USBHSD->UEP2_RX_CTRL ^= USBHS_UEP_R_TOG_DATA1;

                        /* DMA address */
                        Uart.Rx.PkgLen[Uart.Rx.LoadNum] = USBHSD->RX_LEN;

                        Uart.Rx.LoadNum++;
                        if (Uart.Rx.LoadNum >= DEF_CLI_RX_BUF_NUM_MAX)
                        {
                          Uart.Rx.LoadNum = 0x00;
                        }
                        USBHSD->UEP2_RX_DMA = (uint32_t)(uint8_t *)&CdcCli_Rx_Buf[ (Uart.Rx.LoadNum * DEF_USB_HS_PACK_LEN) ];

                        if(Uart.Rx.PgkCnt < DEF_CLI_RX_BUF_NUM_MAX)
                        {
                          Uart.Rx.PgkCnt++;
                        }
                        else
                        {
                          Uart.Rx.PgkCnt = DEF_CLI_RX_BUF_NUM_MAX;

                          USBHSD->UEP2_RX_CTRL &= ~USBHS_UEP_R_RES_MASK;
                          USBHSD->UEP2_RX_CTRL |= USBHS_UEP_R_RES_NAK;
                          Uart.Rx.UsbDownStopFlag = 0x01;
                        }

                        break;

                    default:
                        errflag = 0xFF;
                        break;
                }
                break;

            /* Sof pack processing */
            case USBHS_UIS_TOKEN_SOF:
                break;

            default :
                break;
        }
        USBHSD->INT_FG = USBHS_UIF_TRANSFER;
    }
    else if( intflag & USBHS_UIF_SETUP_ACT )
    {
        USBHSD->UEP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_NAK;
        USBHSD->UEP0_RX_CTRL = USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_NAK;

        /* Store All Setup Values */
        USBHS_SetupReqType  = pUSBHS_SetupReqPak->bRequestType;
        USBHS_SetupReqCode  = pUSBHS_SetupReqPak->bRequest;
        USBHS_SetupReqLen   = pUSBHS_SetupReqPak->wLength;
        USBHS_SetupReqValue = pUSBHS_SetupReqPak->wValue;
        USBHS_SetupReqIndex = pUSBHS_SetupReqPak->wIndex;

        len = 0;
        errflag = 0;
        if ( ( USBHS_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
        {
            /* usb non-standard request processing */
            if( USBHS_SetupReqType & USB_REQ_TYP_CLASS )
            {
                /* Class requests */
                switch( USBHS_SetupReqCode )
                {
                    case CDC_GET_LINE_CODING:
                        pUSBHS_Descr = MyDevDescr;
                        len = 7;
                        break;

                    case CDC_SET_LINE_CODING:
                        break;

                    case CDC_SET_LINE_CTLSTE:
                        break;

                    case CDC_SEND_BREAK:
                        break;

                    default:
                        errflag = 0xff;
                        break;
                }
            }
            else if( USBHS_SetupReqType & USB_REQ_TYP_VENDOR )
            {
                /* Manufacturer request */
            }
            else
            {
                errflag = 0xFF;
            }
            /* Copy Descriptors to Endp0 DMA buffer */
            len = (USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
            memcpy( USBHS_EP0_Buf, pUSBHS_Descr, len );
            pUSBHS_Descr += len;
        }
        else
        {
            /* usb standard request processing */
            switch( USBHS_SetupReqCode )
            {
                /* get device/configuration/string/report/... descriptors */
                case USB_GET_DESCRIPTOR:
                    switch( (uint8_t)(USBHS_SetupReqValue>>8) )
                    {
                        /* get usb device descriptor */
                        case USB_DESCR_TYP_DEVICE:
                            pUSBHS_Descr = MyDevDescr;
                            len = DEF_USBD_DEVICE_DESC_LEN;
                            break;

                        /* get usb configuration descriptor */
                        case USB_DESCR_TYP_CONFIG:
                            /* Query current usb speed */
                            if( ( USBHSD->SPEED_TYPE & USBHS_SPEED_TYPE_MASK ) == USBHS_SPEED_HIGH )
                            {
                                /* High speed mode */
                                USBHS_DevSpeed = USBHS_SPEED_HIGH;
                                USBHS_DevMaxPackLen = DEF_USBD_HS_PACK_SIZE;
                            }
                            else
                            {
                                /* Full speed mode */
                                USBHS_DevSpeed = USBHS_SPEED_FULL;
                                USBHS_DevMaxPackLen = DEF_USBD_FS_PACK_SIZE;
                            }

                            /* Load usb configuration descriptor by speed */
                            if( USBHS_DevSpeed == USBHS_SPEED_HIGH )
                            {
                                /* High speed mode */
                                pUSBHS_Descr = MyCfgDescr_HS;
                                len = DEF_USBD_CONFIG_HS_DESC_LEN;
                            }
                            else
                            {
                                /* Full speed mode */
                                pUSBHS_Descr = MyCfgDescr_FS;
                                len = DEF_USBD_CONFIG_FS_DESC_LEN;
                            }
                            break;

                        /* get usb string descriptor */
                        case USB_DESCR_TYP_STRING:
                            switch( (uint8_t)(USBHS_SetupReqValue&0xFF) )
                            {
                                /* Descriptor 0, Language descriptor */
                                case DEF_STRING_DESC_LANG:
                                    pUSBHS_Descr = MyLangDescr;
                                    len = DEF_USBD_LANG_DESC_LEN;
                                    break;

                                /* Descriptor 1, Manufacturers String descriptor */
                                case DEF_STRING_DESC_MANU:
                                    pUSBHS_Descr = MyManuInfo;
                                    len = DEF_USBD_MANU_DESC_LEN;
                                    break;

                                /* Descriptor 2, Product String descriptor */
                                case DEF_STRING_DESC_PROD:
                                    pUSBHS_Descr = MyProdInfo;
                                    len = DEF_USBD_PROD_DESC_LEN;
                                    break;

